package Models.Enums;

/**
 * Перелік можливих типів пільг для пасажирів.
 * <p>
 * Цей enum визначає різні категорії пільг, які можуть бути застосовані
 * до пасажирів, наприклад, при купівлі квитків або наданні послуг.
 * Кожен тип пільги має асоційоване відображуване ім'я (displayName),
 * яке використовується для представлення пільги користувачеві.
 * </p>
 *
 * @author [Ваше ім'я або назва команди, якщо доречно]
 * @version 1.0
 */
public enum BenefitType {
    /**
     * Відсутність будь-яких пільг.
     * Відображуване ім'я: "Без пільг".
     */
    NONE("Без пільг"),

    /**
     * Пільга для студентів.
     * Відображуване ім'я: "Студент".
     */
    STUDENT("Студент"),

    /**
     * Пільга для пенсіонерів.
     * Відображуване ім'я: "Пенсіонер".
     */
    PENSIONER("Пенсіонер"),

    /**
     * Пільга для учасників бойових дій.
     * Відображуване ім'я: "Учасник бойових дій".
     */
    COMBATANT("Учасник бойових дій");

    /**
     * Відображуване ім'я типу пільги, призначене для показу користувачеві.
     * Наприклад, "Студент", "Пенсіонер".
     */
    private final String displayName;

    /**
     * Конструктор для ініціалізації константи переліку з її відображуваним ім'ям.
     *
     * @param displayName Рядок, що представляє відображуване ім'я для типу пільги.
     */
    BenefitType(String displayName) {
        this.displayName = displayName;
    }

    /**
     * Повертає відображуване ім'я типу пільги.
     * Це ім'я використовується для представлення типу пільги в інтерфейсі користувача.
     *
     * @return Рядок, що є відображуваним ім'ям типу пільги (наприклад, "Студент").
     */
    public String getDisplayName() {
        return displayName;
    }

    /**
     * Повертає рядкове представлення об'єкта, яке є його відображуваним ім'ям.
     * Перевизначений для зручності відображення та відлагодження.
     *
     * @return Відображуване ім'я типу пільги (наприклад, "Пенсіонер").
     */
    @Override
    public String toString() {
        return displayName;
    }
}